In [1]:
import pandas as pd
import numpy as np

In [2]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [3]:
df

                   A         B         C         D
2013-01-01  1.145295 -0.816377 -1.221115 -0.036376
2013-01-02  1.009167 -0.516463 -1.209339 -0.068845
2013-01-03 -0.287561  0.080210  0.293584 -0.747895
2013-01-04 -1.647970 -0.062358  1.056662 -1.903607
2013-01-05 -0.333595  0.661945 -0.231396  0.126650
2013-01-06 -0.728635 -1.049196 -1.559210 -1.242594

In [6]:
df2 = pd.DataFrame({'A': 1.,
 'B': pd.Timestamp('20130102'),
 'C': pd.Series(1, index=list(range(4)), dtype='float32'),
 'D': np.array([3] * 4, dtype='int32'),
 'E': pd.Categorical(["test", "train", "test", "train"]),
 'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [4]:
df['A'] > 0

2013-01-01     True
2013-01-02     True
2013-01-03    False
2013-01-04    False
2013-01-05    False
2013-01-06    False
Freq: D, Name: A, dtype: bool

In [5]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-01  1.145295 -0.816377 -1.221115 -0.036376
2013-01-02  1.009167 -0.516463 -1.209339 -0.068845

In [6]:
df > 0

                A      B      C      D
2013-01-01   True  False  False  False
2013-01-02   True  False  False  False
2013-01-03  False   True   True  False
2013-01-04  False  False   True  False
2013-01-05  False   True  False   True
2013-01-06  False  False  False  False

In [7]:
df[df > 0]

                   A         B         C        D
2013-01-01  1.145295       NaN       NaN      NaN
2013-01-02  1.009167       NaN       NaN      NaN
2013-01-03       NaN  0.080210  0.293584      NaN
2013-01-04       NaN       NaN  1.056662      NaN
2013-01-05       NaN  0.661945       NaN  0.12665
2013-01-06       NaN       NaN       NaN      NaN

In [8]:
df2 = df.copy()

In [9]:
df2

                   A         B         C         D
2013-01-01  1.145295 -0.816377 -1.221115 -0.036376
2013-01-02  1.009167 -0.516463 -1.209339 -0.068845
2013-01-03 -0.287561  0.080210  0.293584 -0.747895
2013-01-04 -1.647970 -0.062358  1.056662 -1.903607
2013-01-05 -0.333595  0.661945 -0.231396  0.126650
2013-01-06 -0.728635 -1.049196 -1.559210 -1.242594

In [10]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [11]:
df2

                   A         B         C         D      E
2013-01-01  1.145295 -0.816377 -1.221115 -0.036376    one
2013-01-02  1.009167 -0.516463 -1.209339 -0.068845    one
2013-01-03 -0.287561  0.080210  0.293584 -0.747895    two
2013-01-04 -1.647970 -0.062358  1.056662 -1.903607  three
2013-01-05 -0.333595  0.661945 -0.231396  0.126650   four
2013-01-06 -0.728635 -1.049196 -1.559210 -1.242594  three

In [12]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [13]:
df['F'] = s1

In [14]:
df.at[dates[0], 'A'] = 0

In [15]:
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.816377 -1.221115 -0.036376  NaN
2013-01-02  1.009167 -0.516463 -1.209339 -0.068845  1.0
2013-01-03 -0.287561  0.080210  0.293584 -0.747895  2.0
2013-01-04 -1.647970 -0.062358  1.056662 -1.903607  3.0
2013-01-05 -0.333595  0.661945 -0.231396  0.126650  4.0
2013-01-06 -0.728635 -1.049196 -1.559210 -1.242594  5.0

In [16]:
df.iat[0, 1] = 0

In [17]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -1.221115 -0.036376  NaN
2013-01-02  1.009167 -0.516463 -1.209339 -0.068845  1.0
2013-01-03 -0.287561  0.080210  0.293584 -0.747895  2.0
2013-01-04 -1.647970 -0.062358  1.056662 -1.903607  3.0
2013-01-05 -0.333595  0.661945 -0.231396  0.126650  4.0
2013-01-06 -0.728635 -1.049196 -1.559210 -1.242594  5.0

In [18]:
len(df)

6

In [19]:
[5] * len(df)

[5, 5, 5, 5, 5, 5]

In [20]:
np.array([5] * len(df))

array([5, 5, 5, 5, 5, 5])

In [21]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [22]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.221115  5  NaN
2013-01-02  1.009167 -0.516463 -1.209339  5  1.0
2013-01-03 -0.287561  0.080210  0.293584  5  2.0
2013-01-04 -1.647970 -0.062358  1.056662  5  3.0
2013-01-05 -0.333595  0.661945 -0.231396  5  4.0
2013-01-06 -0.728635 -1.049196 -1.559210  5  5.0

In [23]:
dates[0:4]

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04'], dtype='datetime64[ns]', freq='D')

In [24]:
list(df.columns)

['A', 'B', 'C', 'D', 'F']

In [26]:
list(df.columns)+['E']

['A', 'B', 'C', 'D', 'F', 'E']

In [27]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000 -1.221115  5  NaN NaN
2013-01-02  1.009167 -0.516463 -1.209339  5  1.0 NaN
2013-01-03 -0.287561  0.080210  0.293584  5  2.0 NaN
2013-01-04 -1.647970 -0.062358  1.056662  5  3.0 NaN

In [28]:
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.221115  5  NaN  1.0
2013-01-02  1.009167 -0.516463 -1.209339  5  1.0  1.0
2013-01-03 -0.287561  0.080210  0.293584  5  2.0  NaN
2013-01-04 -1.647970 -0.062358  1.056662  5  3.0  NaN

In [29]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  1.009167 -0.516463 -1.209339  5  1.0  1.0

In [30]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.221115  5  5.0  1.0
2013-01-02  1.009167 -0.516463 -1.209339  5  1.0  1.0
2013-01-03 -0.287561  0.080210  0.293584  5  2.0  5.0
2013-01-04 -1.647970 -0.062358  1.056662  5  3.0  5.0

In [31]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True